import json

import pytest

from src.services import get_simple_search

"""Проверка функции get_simple_search"""


@pytest.fixture
def transactions() -> list:
    return [
        {
            "Дата операции": "2018-01-01 12:49:53",
            "Дата платежа": "01.01.2018",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Категория": "Переводы",
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0,
        }
    ]


def test_get_simple_search(transactions: list) -> None:
    expected = [
        {
            "Дата операции": "2018-01-01",
            "Дата платежа": "01.01.2018",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Категория": "Переводы",
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0,
        }
    ]
    assert get_simple_search(transactions, "Линзомат") == json.dumps(expected, indent=4, ensure_ascii=False)
